EDT/УТ/src/InformationRegisters/ПолигоныМаршрутизацииЗаказов/ПолигоныМаршрутизацииЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолигоныМаршрутизацииЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПолигонМаршрутизации</name>
    <type>
      <types>CatalogRef.ПолигоныМаршрутизации</types>
    </type>
  </resources>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчет1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаМаршрутизации</name>
    <type>
      <types>CatalogRef.СхемыПолигональнойМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ИндивидуальнаяМаршрутизацияПоРейсам/ИндивидуальнаяМаршрутизацияПоРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндивидуальнаяМаршрутизацияПоРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтвязкаПриСменеПолигона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/РейсТест/РейсТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РейсТест</name>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТипыТранспортовВероут</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалетты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузкиДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РейсМестнойДоставки</name>
    <type>
      <types>BusinessProcessRef.новаРейсМестнойДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>axi_Загрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленноеЗакрытиеРейса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vr_РаспределительныйЦентр</name>
    <type>
      <types>CatalogRef.РаспределительныеЦентрыVeeroute</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодикаМаршрутизации</name>
    <type>
      <types>EnumRef.МетодикаЛогистическойМаршрутизации</types>
    </type>
  </attributes>
  <attributes>
    <name>РольРейса</name>
    <type>
      <types>CatalogRef.РолиТранспорта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасположения</name>
      <type>
        <types>EnumRef.ТипыРасположенияТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресТочки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяВремяОтправления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановоеРасстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийПробег</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияПоПлану</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДвиженияФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапланированнаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительностьОстановки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяПрибытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетноеВремяУбытия</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>CatalogRef.СтатусыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗаказа</name>
      <type>
        <types>EnumRef.ВидыЗаказовВероут</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОперации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказДобавленВРучную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдаленИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагруженИзВероут</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальнаяМаршрутизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поездки</name>
    <attributes>
      <name>НомерПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоездки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяДистанция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемаяПродолжительностьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяНачалаПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяОкончанияПоездки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияДоступностиВодителя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоездки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПолигоныМаршрутизацииЗаказов/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//проверка на удаление
	Если ДополнительныеСвойства.МодифицированностьПередЗаписью И Не Количество() Тогда
		Возврат;
	КонецеСли;	
	
	ПроизводитьОтвязкуИндивидуальнойМаршрутизации = Ложь;
	
	ТЗПараметров = Выгрузить(, "Заказ, ДатаДоставки, ПолигонМаршрутизации");
	
	
	//изменился ли полигон
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ТЗ.Заказ КАК Заказ,
	            |	ТЗ.ДатаДоставки КАК ДатаДоставки,
	            |	ТЗ.ПолигонМаршрутизации КАК ПолигонМаршрутизации
	            |ПОМЕСТИТЬ ВТ_Заказы
	            |ИЗ
	            |	&ТЗ КАК ТЗ
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_Заказы.Заказ КАК Заказ,
	            |	ВТ_Заказы.ДатаДоставки КАК ДатаДоставки,
	            |	ВТ_Заказы.ПолигонМаршрутизации КАК ПолигонМаршрутизации
	            |ИЗ
	            |	ВТ_Заказы КАК ВТ_Заказы
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов КАК ПолигоныМаршрутизацииЗаказов
	            |		ПО ВТ_Заказы.Заказ = ПолигоныМаршрутизацииЗаказов.Заказ
	            |			И ВТ_Заказы.ДатаДоставки = ПолигоныМаршрутизацииЗаказов.ДатаДоставки
	            |			И ВТ_Заказы.ПолигонМаршрутизации <> ПолигоныМаршрутизацииЗаказов.ПолигонМаршрутизации";
	Зап.УстановитьПараметр("ТЗ", ТЗПараметров);
	
	Рез = Зап.Выполнить();
	
	Если Не Рез.Пустой() Тогда
		ПроизводитьОтвязкуИндивидуальнойМаршрутизации = Истина;
	КонецЕсли;	
		
	
	
	Если ПроизводитьОтвязкуИндивидуальнойМаршрутизации Тогда
		
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ТЗ.Заказ КАК Заказ,
		            |	ТЗ.ДатаДоставки КАК ДатаДоставки
		            |ПОМЕСТИТЬ ВТ_Заказы
		            |ИЗ
		            |	&ТЗ КАК ТЗ
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	ВТ_Заказы.Заказ КАК Заказ,
		            |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.ДатаПланирования КАК ДатаПланирования,
		            |	ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс КАК Рейс
		            |ИЗ
		            |	ВТ_Заказы КАК ВТ_Заказы
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СрезПоследних КАК ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних
		            |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РейсТест.Заказы КАК РейсЗаказы
		            |			ПО ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс = РейсЗаказы.Ссылка
		            |		ПО ВТ_Заказы.Заказ = ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Заказ
		            |			И ВТ_Заказы.ДатаДоставки <= ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.ДатаПланирования
		            |ГДЕ
		            |	ЕСТЬNULL(РейсЗаказы.Заказ, ИСТИНА) = ИСТИНА
		            |	И ИндивидуальнаяМаршрутизацияПоРейсамСрезПоследних.Рейс <> ЗНАЧЕНИЕ(Документ.РейсТест.ПустаяСсылка)";
		Зап.УстановитьПараметр("ТЗ", ТЗПараметров);
		Рез = Зап.Выполнить();
		
		Если Рез.Пустой() Тогда
			Возврат;
		КонецеСли;	
			
		Выб = Рез.Выбрать();
		
		ТекВр = ТекущаяДата();
		
		Пока Выб.Следующий() Цикл
			Наб = РегистрыСведений.ИндивидуальнаяМаршрутизацияПоРейсам.СоздатьНаборЗаписей();
			Наб.Отбор.Период.Установить(ТекВр);
			Наб.Отбор.ДатаПланирования.Установить(Выб.ДатаПланирования);
			Наб.Отбор.Заказ.Установить(Выб.Заказ);
			
			Нов = Наб.Добавить();
			ЗаполнитьЗначенияСвойств(Нов, Выб);
			Нов.Период = ТекВр;
			Нов.Пользователь = ПараметрыСеанса.ТекущийПользователь;
			Нов.Рейс = "";
			Нов.ОтвязкаПриСменеПолигона = Истина;
			
			Наб.Записать();
		КонецЦикла;	
	КонецеСли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("МодифицированностьПередЗаписью", Модифицированность());
КонецПроцедуры
